; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v11 ?v1)
             (pred_2 ?v2 ?v8)
             (pred_5 ?v11 ?v8)
             (pred_8 ?v3 ?v11 )
	     (pred_1 ?v11)
             (pred_10 ?v5)
             (pred_3 ?v2)
             (pred_12 ?v8)
             (pred_11 ?v11)
             (pred_6 ?v2)
             (pred_4 ?v11)
             (pred_7 ))



(:action op_2
:parameters (?v4 ?v10 ?v7 ?v12)
:precondition (and (pred_10 ?v4) (pred_10 ?v10) (pred_3 ?v7) (pred_12 ?v12)
          (pred_9 ?v4 ?v10) (pred_2 ?v7 ?v12)
                   (pred_5 ?v10 ?v12) (pred_1 ?v4) 
                   (pred_11 ?v10) (pred_6 ?v7))
:effect (and  (pred_4 ?v10) (not (pred_11 ?v10))))


(:action op_3
:parameters (?v4 ?v6)
:precondition (and (pred_10 ?v4) (pred_10 ?v6)
               (pred_1 ?v4) (pred_9 ?v4 ?v6) (pred_4 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v4))))

(:action op_1
:parameters (?v4 ?v7)
:precondition (and (pred_10 ?v4) (pred_3 ?v7) 
                  (pred_1 ?v4) (pred_8 ?v7 ?v4) (pred_7 ))
:effect (and (pred_6 ?v7)
   (not (pred_8 ?v7 ?v4)) (not (pred_7 ))))


(:action op_5
:parameters (?v4 ?v13 ?v9)
:precondition (and (pred_10 ?v4) (pred_3 ?v13) (pred_3 ?v9)
                  (pred_1 ?v4) (pred_6 ?v9) (pred_8 ?v13 ?v4))
:effect (and (pred_6 ?v13) (pred_8 ?v9 ?v4)
        (not (pred_6 ?v9)) (not (pred_8 ?v13 ?v4))))

(:action op_4
:parameters (?v4 ?v7)
:precondition (and (pred_10 ?v4) (pred_3 ?v7) 
                  (pred_1 ?v4) (pred_6 ?v7))
:effect (and (pred_7 ) (pred_8 ?v7 ?v4) (not (pred_6 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_13 obj_20 obj_03 obj_09 obj_07 obj_16 obj_10 obj_02 obj_01 obj_11 obj_14 obj_17 obj_08 obj_04 obj_18
    obj_15 obj_19
    obj_05 obj_12 obj_06
    )

    (:init
       (pred_7)

       (pred_10 obj_21)
       (pred_10 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_02)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_10 obj_14)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_04)
       (pred_10 obj_18)
       (pred_12 obj_15)
       (pred_12 obj_19)
       (pred_3 obj_05)
       (pred_3 obj_12)
       (pred_3 obj_06)

       (pred_9 obj_21 obj_09)
       (pred_9 obj_21 obj_13)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_13 obj_21)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_13)
       (pred_9 obj_03 obj_10)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_09 obj_07)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_16)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_09)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_10)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_07)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_10 obj_03)
       (pred_9 obj_10 obj_16)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_18 obj_04)
       (pred_11 obj_03)
       (pred_11 obj_21)
       (pred_11 obj_07)
       (pred_5  obj_03 obj_15)
       (pred_5  obj_21 obj_19)
       (pred_5  obj_07 obj_15)
       (pred_4 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_01)
       (pred_4 obj_11)
       (pred_4 obj_14)
       (pred_4 obj_17)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_18)

       (pred_2  obj_05 obj_15)
       (pred_2  obj_12 obj_19)
       (pred_2  obj_06 obj_15)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_06 obj_13)
       (pred_1 obj_16)
    )

    (:goal (and
       (pred_8 obj_05 obj_17)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_06 obj_20)
    ))
(:constraints
  (always (not (pred_1 obj_07)))
)
)

; plan
1. (op_1 obj_16 obj_12)
   deleted: (pred_8 obj_12 obj_16) (pred_7)
   added: (pred_6 obj_12)
   goals met: 0 of 3
2. (op_3 obj_16 obj_20)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_20)
   goals met: 0 of 3
3. (op_3 obj_20 obj_13)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_13)
   goals met: 0 of 3
4. (op_2 obj_13 obj_21 obj_12 obj_19)
   deleted: (pred_11 obj_21)
   added: (pred_4 obj_21)
   goals met: 0 of 3
5. (op_5 obj_13 obj_06 obj_12)
   deleted: (pred_6 obj_12) (pred_8 obj_06 obj_13)
   added: (pred_6 obj_06) (pred_8 obj_12 obj_13)
   goals met: 0 of 3
6. (op_3 obj_13 obj_20)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_20)
   goals met: 0 of 3
7. (op_4 obj_20 obj_06)
   deleted: (pred_6 obj_06)
   added: (pred_7) (pred_8 obj_06 obj_20)
   goals met: 1 of 3
8. (op_3 obj_20 obj_13)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_13)
   goals met: 1 of 3
9. (op_1 obj_13 obj_12)
   deleted: (pred_8 obj_12 obj_13) (pred_7)
   added: (pred_6 obj_12)
   goals met: 1 of 3
10. (op_3 obj_13 obj_20)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_20)
   goals met: 1 of 3
11. (op_3 obj_20 obj_16)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_16)
   goals met: 1 of 3
12. (op_3 obj_16 obj_11)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_11)
   goals met: 1 of 3
13. (op_3 obj_11 obj_01)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_01)
   goals met: 1 of 3
14. (op_4 obj_01 obj_12)
   deleted: (pred_6 obj_12)
   added: (pred_7) (pred_8 obj_12 obj_01)
   goals met: 1 of 3
15. (op_3 obj_01 obj_11)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_11)
   goals met: 1 of 3
16. (op_1 obj_11 obj_05)
   deleted: (pred_8 obj_05 obj_11) (pred_7)
   added: (pred_6 obj_05)
   goals met: 1 of 3
17. (op_3 obj_11 obj_01)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_01)
   goals met: 1 of 3
18. (op_5 obj_01 obj_12 obj_05)
   deleted: (pred_6 obj_05) (pred_8 obj_12 obj_01)
   added: (pred_6 obj_12) (pred_8 obj_05 obj_01)
   goals met: 1 of 3
19. (op_3 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 1 of 3
20. (op_3 obj_02 obj_09)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_09)
   goals met: 1 of 3
21. (op_4 obj_09 obj_12)
   deleted: (pred_6 obj_12)
   added: (pred_7) (pred_8 obj_12 obj_09)
   goals met: 2 of 3
22. (op_3 obj_09 obj_02)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_02)
   goals met: 2 of 3
23. (op_3 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 2 of 3
24. (op_1 obj_01 obj_05)
   deleted: (pred_8 obj_05 obj_01) (pred_7)
   added: (pred_6 obj_05)
   goals met: 2 of 3
25. (op_3 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 2 of 3
26. (op_3 obj_02 obj_17)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_17)
   goals met: 2 of 3
27. (op_4 obj_17 obj_05)
   deleted: (pred_6 obj_05)
   added: (pred_7) (pred_8 obj_05 obj_17)
   goals met: 3 of 3
